Tekla.Structures.Plugins.DirectManipulation.Services.Tools.Picking.SnappedPoint
Initializes a new instance of the Tekla.Structures.Plugins.DirectManipulation.Services.Tools.Picking.SnappedPoint class.

Tekla.Structures.Plugins.DirectManipulation.Services.Tools.Picking.SnappedPoint.Point
Gets or sets the location of the snapping point.

Tekla.Structures.Plugins.DirectManipulation.Services.Tools.Picking.SnappedPoint.HitTypes
Gets or sets the hit type flag.
Remarks:
For the time being this property should be kept internal.

Tekla.Structures.Plugins.DirectManipulation.Services.Tools.Picking.SnappedPoint.References
Gets or sets the geometric references.
Remarks:
For the time being this property should be kept internal.

Tekla.Structures.Plugins.DirectManipulation.Services.Tools.Picking.SnappedPoint.InternalSnappedPoint
Gets the internal snapped point.